[
    {
      "id": 1,
      "name": "Circles",
      "image": "/assets/eye_pic.png",
      "description": "For the circles project I knew quite fast that I would like to do something with eyes. I then decided that I would like to add music to this project since I have been wanting to learn how to make shapes react to the different amplitudes of sound and felt that circles would be the ideal shape to do this. Upon further research, I found that it would actually make more sense to use P5’s getEnergy() which returns the amount of energy at a specific frequency ranges (bass, lowMid, mid , highMid and treble). I used algorithmic thinking to come up with the process of breaking down the eye into 5 different circles that each respond to one of the frequency ranges. I assigned the ‘treble’—representing the human voice in my song—to control the pupil of the eye, making it the central point that moves when the singer sings.",
      "link": "https://editor.p5js.org/imoleadrews/sketches/au5O2-hLC"
    },
    {
      "id": 2,
      "name": "Pattern",
      "image": "/assets/pattern_image.png",
      "description": "In the pattern I tried to add things that appeared more complex than what the code eventually was. Through trial and error, I figured out that overlapping the diamonds made the pattern appear more interesting and by changing the colour of the diamond stroke in draw() I was able to give the illusion of flickering lights. ",
      "link": "https://editor.p5js.org/imoleadrews/sketches/Qwy5uF4z8"
    },
    {
      "id": 3,
      "name": "Happiness",
      "image": "/assets/friends_image.png",
      "description": "For Happiness, the first thing that came to mind was a holiday that I went on with my childhood best friend. I used the BodySegmentation library from ML5.js which I set to ‘parts’ which segments the human form into different parts and applied this to a short video of the two of us on holiday. Since that was not hard in itself, the algorithmic thinking came in when I wanted to create movement in the background to match the energy found in the video and the holiday in general. I decided to create multiple rectangles in the background using a for loop with the stroke of each rectangle changing randomly according to a set of colours which create a flashing background and depth giving the illusion of movement and energy. One thing that I did not figure out was how to get the ML5 model to play immediately uplon pushing run. I tried placing the loading of the model in the preload() function but this did not help so I am still a bit confused about that. ",
      "link": "https://editor.p5js.org/imoleadrews/sketches/ubLXsRiEo"
    },
    {
      "id": 4,
      "name": "Spirit",
      "image": "/assets/spirit.png",
      "description": "The most challenging part of this exercise for me was understanding how the Three.js documentation is structured. At first, everything seemed straightforward, but I quickly realized that grasping how the documentation explains concepts took some time and was a bit confusing. Now, I feel like I have a better understanding, but I still have a lot to learn. I plan to watch more videos and dive deeper into the material. I followed a tutorial that showed me how to move spheres, which helped me get a better grasp of moving objects in Three.js, so I'll keep looking for similar resources as I feel these are easier to understand for a complete newbie.",
      "link": "https://github.com/yourusername/portfolio"
    },
    {
      "id": 5,
      "name": "Clown",
      "image": "/assets/clown_image.png",
      "description": "For my greeting card I then followed how to add the FaceMesh from ML5’s library which was very straight forward. I learned about the UV Unwrap for the Face Mesh Detection from a by Dan Shiffman which I then used to find my own keypoints for my clown. Most of my time was spent doing this but overall I am happy that I learned how to do this since I have been interested in working with ML5 for a while.",
      "link": "https://editor.p5js.org/imoleadrews/sketches/PujEZTfH6"
    },
    {
      "id": 6,
      "name": "Zombie",
      "image": "/assets/zombie.png",
      "description": "An e-commerce site built with Next.js and Stripe for payments.",
      "link": "https://github.com/yourusername/ecommerce-store"
    }
  ]
  